package api9_Ex;

/*
  콘솔을 통해서 파일명을 입력받은후, 입력받은 파일의 성격을 구해서 화면에 출력하시오.
  예) 화일명을 입력하세요? abc.jpg
     abc.jpg ==> 그림파일
     계속할까요?(Y/N) Y
     ================================
     화일명을 입력하세요? atom.txt
     atom.txt ==> 텍스트파일
     계속할까요?(Y/N) y
     ================================
     화일명을 입력하세요? mbc.zip
     mbc.zip ==> 압축파일
     계속할까요?(Y/N) Y
     ================================
     화일명을 입력하세요? sbs.xlsx
     sbs.xlsx ==> 엑셀파일
     계속할까요?(Y/N) y
     ================================
     화일명을 입력하세요? seoul.hwp
     seoul.hwp ==> 한글파일
     계속할까요?(Y/N) Y
     ================================
     화일명을 입력하세요? busan.gif
     busan.hwp ==> 그림파일
     계속할까요?(Y/N) n
     ================================
     수고하셨습니다.
*/
public class Test1 {
	public static void main(String[] args) {
		
	}
}